# Используя стек из задания 1, решите задачу на проверку сбалансированности скобок.
# Сбалансированность скобок означает, что каждый открывающий символ имеет соответствующий ему закрывающий,
# и пары скобок правильно вложены друг в друга.
# Пример сбалансированных последовательностей скобок:
#
# (((([{}]))))
# [([])((([[[]]])))]{()}
# {{[()]}}
# Несбалансированные последовательности:
#
# }{}
# {{[(])]}}
# [[{())}]
# Программа ожидает на вход строку со скобками. На выход сообщение: «Сбалансированно», если строка корректная,
# и «Несбалансированно», если строка составлена неверно.

import tools.stack_class as stack

if __name__ == '__main__':
    stack = stack.Stack()
    brackets = input('Введите скобки: ')

